In [1]:
import pyarrow as pa
import feather
import pandas as pd
import numpy as np

In [2]:
%pwd

'C:\\Users\\afs95\\MyPython\\DataScienceGA\\DS_work\\DS_repo\\Homework\\Unit2'

In [3]:
df = pd.read_csv('data/titanic.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [4]:
maxmin = pd.concat([df.max(), df.min()], axis=1)
maxmin.columns = ['Max', 'Min']
maxmin

                                     Max                  Min
PassengerId                          891                    1
Survived                               1                    0
Pclass                                 3                    1
Name         van Melkebeke, Mr. Philemon  Abbing, Mr. Anthony
Sex                                 male               female
Age                                   80                 0.42
SibSp                                  8                    0
Parch                                  6                    0
Ticket                         WE/P 5735               110152
Fare                             512.329                    0

In [5]:
converters = {}

In [6]:
int64 = 2**64 - 1
int8 = 2**8 - 1
int32 = 2**32 - 1 
int64, int32, int8

(18446744073709551615, 4294967295, 255)

In [7]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [8]:
if maxmin.loc['Age', 'Min'] >= 0:
    print(df['Parch'].astype(np.uint8).memory_usage())

1019

In [9]:
df[['Survived', 'Pclass', 'SibSp', 'Parch']].memory_usage() - df[['Survived', 'Pclass', 'SibSp', 'Parch']].astype(np.uint8).memory_usage()

Index          0
Survived    6237
Pclass      6237
SibSp       6237
Parch       6237
dtype: int64

In [10]:
df[['Survived', 'Pclass', 'SibSp', 'Parch']].astype(np.uint8).memory_usage()

Index       128
Survived    891
Pclass      891
SibSp       891
Parch       891
dtype: int64

In [11]:
df[['Sex', 'Embarked']].astype('category').memory_usage()

Index       128
Sex         987
Embarked    995
dtype: int64

In [22]:
df2 = df.copy()
df2[['Survived', 'Pclass', 'SibSp', 'Parch']] = df2[['Survived', 'Pclass', 'SibSp', 'Parch']].astype(np.uint8)
df2[['Sex', 'Embarked']] = df2[['Sex', 'Embarked']].astype('category')
df2.memory_usage()

Index           128
PassengerId    7128
Survived        891
Pclass          891
Name           7128
Sex             987
Age            7128
SibSp           891
Parch           891
Ticket         7128
Fare           7128
Cabin          7128
Embarked        995
dtype: int64

In [23]:
df.memory_usage().sum(), df2.memory_usage().sum()

(85664, 48442)

In [24]:
df.memory_usage().sum() - df2.memory_usage().sum()

37222

In [25]:
feather_path = 'AlecSchneider/titanic.ftr'
df2.to_feather(feather_path)

In [28]:
dfftr = pd.read_feather(feather_path, use_threads=False)
dfftr.memory_usage()

Index           128
PassengerId    7128
Survived        891
Pclass          891
Name           7128
Sex             987
Age            7128
SibSp           891
Parch           891
Ticket         7128
Fare           7128
Cabin          7128
Embarked        995
dtype: int64